benchmark/leveldb/results/large-ratio/mris_ratio_ssd.2.3.log
LevelDB:    version 1.5
Date:       Thu Dec  6 21:27:59 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    100000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
mris_facebook :    3430.235 micros/op;   13.7 MB/s small: 10000/0; big: 5000/0
Microseconds per op:
Count: 15000  Average: 3430.2441  StdDev: 18908.42
Min: 0.0000  Median: 1476.1905  Max: 708284.0000
------------------------------------------------------
[       0,       1 )      39   0.260%   0.260% 
[       1,       2 )     457   3.047%   3.307% #
[       2,       3 )    4101  27.340%  30.647% #####
[       3,       4 )     261   1.740%  32.387% 
[       4,       5 )      70   0.467%  32.853% 
[       5,       6 )      12   0.080%  32.933% 
[      12,      14 )       6   0.040%  32.973% 
[      14,      16 )       2   0.013%  32.987% 
[      16,      18 )       1   0.007%  32.993% 
[      18,      20 )       1   0.007%  33.000% 
[      20,      25 )       2   0.013%  33.013% 
[      25,      30 )      24   0.160%  33.173% 
[      30,      35 )      47   0.313%  33.487% 
[      35,      40 )     192   1.280%  34.767% 
[      40,      45 )     472   3.147%  37.913% #
[      45,      50 )      46   0.307%  38.220% 
[      50,      60 )      55   0.367%  38.587% 
[      60,      70 )      14   0.093%  38.680% 
[      70,      80 )      11   0.073%  38.753% 
[      80,      90 )      21   0.140%  38.893% 
[      90,     100 )      56   0.373%  39.267% 
[     100,     120 )     202   1.347%  40.613% 
[     120,     140 )      87   0.580%  41.193% 
[     140,     160 )      49   0.327%  41.520% 
[     160,     180 )      36   0.240%  41.760% 
[     180,     200 )      32   0.213%  41.973% 
[     200,     250 )      40   0.267%  42.240% 
[     250,     300 )      15   0.100%  42.340% 
[     300,     350 )       5   0.033%  42.373% 
[     400,     450 )       7   0.047%  42.420% 
[     450,     500 )       6   0.040%  42.460% 
[     500,     600 )      26   0.173%  42.633% 
[     600,     700 )      38   0.253%  42.887% 
[     700,     800 )      23   0.153%  43.040% 
[     800,     900 )      31   0.207%  43.247% 
[     900,    1000 )      81   0.540%  43.787% 
[    1000,    1200 )     326   2.173%  45.960% 
[    1200,    1400 )     350   2.333%  48.293% 
[    1400,    1600 )     672   4.480%  52.773% #
[    1600,    1800 )     253   1.687%  54.460% 
[    1800,    2000 )      31   0.207%  54.667% 
[    2000,    2500 )     249   1.660%  56.327% 
[    2500,    3000 )    1189   7.927%  64.253% ##
[    3000,    3500 )     347   2.313%  66.567% 
[    3500,    4000 )     735   4.900%  71.467% #
[    4000,    4500 )     324   2.160%  73.627% 
[    4500,    5000 )     603   4.020%  77.647% #
[    5000,    6000 )    1264   8.427%  86.073% ##
[    6000,    7000 )    1309   8.727%  94.800% ##
[    7000,    8000 )     433   2.887%  97.687% #
[    8000,    9000 )     207   1.380%  99.067% 
[    9000,   10000 )      33   0.220%  99.287% 
[   10000,   12000 )      21   0.140%  99.427% 
[   12000,   14000 )       7   0.047%  99.473% 
[   14000,   16000 )       4   0.027%  99.500% 
[   16000,   18000 )       3   0.020%  99.520% 
[   18000,   20000 )       1   0.007%  99.527% 
[   20000,   25000 )       7   0.047%  99.573% 
[   25000,   30000 )       3   0.020%  99.593% 
[   30000,   35000 )       1   0.007%  99.600% 
[   35000,   40000 )       1   0.007%  99.607% 
[   45000,   50000 )       1   0.007%  99.613% 
[   50000,   60000 )       1   0.007%  99.620% 
[   90000,  100000 )       1   0.007%  99.627% 
[  100000,  120000 )       5   0.033%  99.660% 
[  120000,  140000 )       8   0.053%  99.713% 
[  140000,  160000 )       4   0.027%  99.740% 
[  160000,  180000 )       3   0.020%  99.760% 
[  180000,  200000 )       3   0.020%  99.780% 
[  200000,  250000 )       3   0.020%  99.800% 
[  250000,  300000 )       9   0.060%  99.860% 
[  300000,  350000 )      10   0.067%  99.927% 
[  350000,  400000 )       5   0.033%  99.960% 
[  450000,  500000 )       1   0.007%  99.967% 
[  500000,  600000 )       1   0.007%  99.973% 
[  600000,  700000 )       3   0.020%  99.993% 
[  700000,  800000 )       1   0.007% 100.000% 

----- /mnt/largespace/mris_ratio_ssd_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	5000
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0