benchmark/leveldb/results/large-ratio/mris_ratio_ssd.32.1.log
LevelDB:    version 1.5
Date:       Thu Dec  6 21:34:10 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    100000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
mris_facebook :    1601.229 micros/op;    7.1 MB/s small: 10000/0; big: 313/0
Microseconds per op:
Count: 10313  Average: 1601.2474  StdDev: 10365.68
Min: 0.0000  Median: 724.3590  Max: 368258.0000
------------------------------------------------------
[       0,       1 )      63   0.611%   0.611% 
[       1,       2 )      92   0.892%   1.503% 
[       2,       3 )     139   1.348%   2.851% 
[       3,       4 )      12   0.116%   2.967% 
[       4,       5 )       2   0.019%   2.987% 
[      12,      14 )       1   0.010%   2.996% 
[      18,      20 )       1   0.010%   3.006% 
[      20,      25 )      22   0.213%   3.219% 
[      25,      30 )      94   0.911%   4.131% 
[      30,      35 )     246   2.385%   6.516% 
[      35,      40 )    1066  10.336%  16.853% ##
[      40,      45 )     479   4.645%  21.497% #
[      45,      50 )      26   0.252%  21.749% 
[      50,      60 )      71   0.688%  22.438% 
[      60,      70 )       8   0.078%  22.515% 
[      70,      80 )       2   0.019%  22.535% 
[      80,      90 )     520   5.042%  27.577% #
[      90,     100 )     745   7.224%  34.801% #
[     100,     120 )     668   6.477%  41.278% #
[     120,     140 )     387   3.753%  45.031% #
[     140,     160 )     208   2.017%  47.047% 
[     160,     180 )     115   1.115%  48.163% 
[     180,     200 )      74   0.718%  48.880% 
[     200,     250 )      40   0.388%  49.268% 
[     250,     300 )      10   0.097%  49.365% 
[     300,     350 )       1   0.010%  49.375% 
[     350,     400 )       1   0.010%  49.384% 
[     400,     450 )      15   0.145%  49.530% 
[     450,     500 )       7   0.068%  49.598% 
[     500,     600 )      23   0.223%  49.821% 
[     600,     700 )       9   0.087%  49.908% 
[     700,     800 )      39   0.378%  50.286% 
[     800,     900 )      88   0.853%  51.139% 
[     900,    1000 )     192   1.862%  53.001% 
[    1000,    1200 )     587   5.692%  58.693% #
[    1200,    1400 )     367   3.559%  62.252% #
[    1400,    1600 )    1129  10.947%  73.199% ##
[    1600,    1800 )     151   1.464%  74.663% 
[    1800,    2000 )      24   0.233%  74.896% 
[    2000,    2500 )      50   0.485%  75.381% 
[    2500,    3000 )    1771  17.173%  92.553% ###
[    3000,    3500 )     368   3.568%  96.121% #
[    3500,    4000 )      67   0.650%  96.771% 
[    4000,    4500 )     103   0.999%  97.770% 
[    4500,    5000 )      33   0.320%  98.090% 
[    5000,    6000 )      71   0.688%  98.778% 
[    6000,    7000 )      41   0.398%  99.176% 
[    7000,    8000 )      54   0.524%  99.699% 
[    8000,    9000 )       1   0.010%  99.709% 
[    9000,   10000 )       1   0.010%  99.719% 
[   10000,   12000 )       2   0.019%  99.738% 
[   12000,   14000 )       3   0.029%  99.767% 
[   16000,   18000 )       1   0.010%  99.777% 
[   50000,   60000 )       1   0.010%  99.787% 
[   70000,   80000 )       1   0.010%  99.796% 
[   80000,   90000 )       1   0.010%  99.806% 
[  100000,  120000 )       7   0.068%  99.874% 
[  120000,  140000 )       2   0.019%  99.893% 
[  140000,  160000 )       1   0.010%  99.903% 
[  200000,  250000 )       2   0.019%  99.922% 
[  250000,  300000 )       3   0.029%  99.952% 
[  300000,  350000 )       3   0.029%  99.981% 
[  350000,  400000 )       2   0.019% 100.000% 

----- /mnt/largespace/mris_ratio_ssd_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	313
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0